/* 
  Localizable.strings
  Secrets

  Created by Paulo Andrade on 23/07/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/


// MASShortcut
/* Tooltip for non-empty shortcut button */
"Click to record new shortcut" = "Click to record new shortcut";

/* Tooltip for hint button near the non-empty shortcut */
"Delete shortcut" = "Delete shortcut";

/* Empty shortcut button in normal state */
"Record Shortcut" = "Record Shortcut";

/* Title for alert when shortcut is already used. %@ will be replaced with the keyboard shortcut */
"The key combination %@ cannot be used" = "The key combination %@ cannot be used";

/* Non-empty shortcut button in recording state */
"Type New Shortcut" = "Type Shortcut";

/* Empty shortcut button in recording state */
"Type Shortcut" = "Type Shortcut";

/* Cancel action button for non-empty shortcut in recording state */
"Use Old Shortcut" = "Cancel";


// Helper App
/* Enable button title when displaying the "run in background" alert */
"HelperApp.BgRunningAlert.Enable" = "Enable";

/* Disable button title when displaying the "run in background" alert */
"HelperApp.BgRunningAlert.Disable" = "Disable";

/* Title for "run in background" alert. %@ will be replaced with the application name: Secrets */
"HelperApp.BgRunningAlert.Title" = "Enable search features even when %@ is not running?";

/* Message for "run in background" alert */
"HelperApp.BgRunningAlert.Message" = "%@ can run a helper app in the background allowing you to use the search shortcut or the menu bar button even when %@ is not running. For a better experience, it's recommended to enabled this option.";


// Menu Items
/* Default copy menu item action title */
"MenuItem.Copy" = "Copy";
/* Default copy alternate menu item action title */
"MenuItem.CopyAlternate" = "Copy Alternate";
/* Show detail pane menu item */
"MenuItem.ShowDetailPane" = "Show Detail Pane";
/* Hide detail pane menu item */
"MenuItem.HideDetailPane" = "Hide Detail Pane";
/* Copy password menu item */
"MenuItem.CopyPassword" = "Copy Password";
/* Copy card number menu item */
"MenuItem.CopyCardNumber" = "Copy Card Number";
/* Copy iban menu item */
"MenuItem.CopyIBAN" = "Copy IBAN";
/* Copy one-time password menu item */
"MenuItem.CopyOneTimePassword" = "Copy One-Time Password";
/* Copy username menu item */
"MenuItem.CopyUsername" = "Copy Username";
/* Copy security code menu item */
"MenuItem.CopySecurityCode" = "Copy Security Code";

// Preferences
/* Preferences window title */
"Preferences.WindowTitle" = "Preferences";
/* Preferences search filter title */
"Preferences.Search" = "Search";
/* Preferences security filter title */
"Preferences.Security" = "Security";
/* Preferences sync filter title */
"Preferences.Sync" = "Sync";
/* Preferences store filter title */
"Preferences.Store" = "Store";
/* Preferences security filter title */
"Preferences.All" = "All";
/* Preferences "never" setting */
"Preferences.Never" = "Never";
/* Preferences search keyboard shortcut setting */
"Preferences.SearchShortcut" = "Search keyboard shortcut";
/* Preferences show menu bar icon setting */
"Preferences.ShowMenuBarIcon" = "Show icon in menu bar";
/* Preferences safari extension setting */
"Preferences.SafariExtension" = "Safari extension";
/* Preferences automatically submit logins setting */
"Preferences.AutoSubmitLogins" = "Automatically submit logins";
/* Preferences automatically submit logins setting */
"Preferences.AutoSubmitLogins" = "Automatically submit logins";
/* Preferences enable search at login setting */
"Preferences.EnableSearchAtLogin" = "Enable search at login";
/* Preferences enable search at login explanation */
"Preferences.EnableSearchAtLoginExplained" = "Enabling search at login allows you to use the shortcut and menu bar even when %@ is not running.";
/* Preferences rebuild index setting */
"Preferences.RebuildIndex" = "Rebuild Index";
/* Preferences rebuild index button */
"Preferences.Rebuild" = "Rebuild";
/* Preferences rebuilding status */
"Preferences.Rebuilding" = "Rebuilding…";
/* Preferences lock automatically setting */
"Preferences.LockAutomatically" = "Lock automatically";
/* Preferences lock on computer sleep setting */
"Preferences.LockOnComputerSleep" = "Lock on computer sleep";
/* Preferences lock on screensaver setting */
"Preferences.LockOnScreensaver" = "Lock on screensaver";
/* Preferences lock on user switch setting */
"Preferences.LockOnUserSwitch" = "Lock on user switch";
/* Preferences clear clipboard timeout setting */
"Preferences.ClearClipboard" = "Clear clipboard";
/* Preferences version information */
"Preferences.Version" = "Version";
/* Preferences use device authentication setting */
"Preferences.UseDeviceAuthentication" = "Use device authentication";
/* Preferences device authentication explanation */
"Preferences.DeviceAuthenticationInfo" = "When using device authentication your passphrase is stored securely on your Mac's keychain and unlocked with Touch ID.";

/* iCloud Sync footer explanation when the user has iCloud disabled and cannot enable (signed out, iCloud drive disabled...) */
"iCloud.Status.Unavailable" = "iCloud is currently not available. You may be signed out of iCloud or have \"iCloud Drive\" disabled. Check %@.";

// Unlock View Controller
/* Presented above the unlock prompt when user name can't be obtained */
"Unlock.WelcomeBack" = "Welcome back";

// Setup
"Setup.Welcome" = "Welcome";
"Setup.WelcomeUser" = "Welcome %@";

// New item
"NewItem.NewItem" = "New Item";
"NewItem.ItemTypes" = "Item Types";

// Search
"Search.Prompt.Placeholder" = "Search";
/* Fill item in <application name> (eg, Safari, Chrome) */
"Search.FillItem" = "Fill item in %@?";
/* Send item to <application name>*/
"Search.SendItem" = "Send item in %@?";
/* Fill alert title */
"Search.FillAlert.Title" = "%@ is not associated with this login";
/* Fill alert message */
"Search.FillAlert.Message" = "Are you sure you want to use your login \"%@\" to fill in the site at %@";
/* Fill alert suppression */
"Search.FillAlert.Suppression" = "Associate %@ with the login \"%@\"";

// QRCode Searching

"QRCodeSearch.Searching" = "Searching for a compatible QR Code in open windows";
"QRCodeSearch.NoResults" = "Could not find any compatible QR Code in open windows";
"QRCodeSearch.CodeFound" = "Found the following code in a %@ window:\n\n%@";


// User notification
"UserNotification.EnableSafariExtension.Title" = "Fill Logins directly in Safari";
"UserNotification.EnableSafariExtension.Message" = "Enable our Safari Extension to quickly fill Logins while browsing.";

